In [1]:
# 以下兩行是畫圖用
%matplotlib inline
import matplotlib.pyplot as plt 
# 載入pandas套件
import pandas as pd
import numpy as np

範例1

In [2]:
scores = {'Math':[90,50,70,80],
      'English':[60,70,90,50],
      'History':[33,75,88,60]}
scores

{'Math': [90, 50, 70, 80],
 'English': [60, 70, 90, 50],
 'History': [33, 75, 88, 60]}

範例2

In [3]:
pd.DataFrame(scores)

   Math  English  History
0    90       60       33
1    50       70       75
2    70       90       88
3    80       50       60

範例3

In [4]:
list1 = [[90, 60, 33],
       [50, 70, 75],
       [70, 90, 88],
       [80, 50, 60]]
pd.DataFrame(list1)

    0   1   2
0  90  60  33
1  50  70  75
2  70  90  88
3  80  50  60

範例4

In [5]:
list1 = [[90, 60, 33],
       [50, 70, 75],
       [70, 90, 88],
       [80, 50, 60]]
pd.DataFrame(list1, columns=['Math', 'English', 'History'])

   Math  English  History
0    90       60       33
1    50       70       75
2    70       90       88
3    80       50       60

範例5

In [6]:
list1 = [[90, 60, 33],
       [50, 70, 75],
       [70, 90, 88],
       [80, 50, 60]]
df = pd.DataFrame(list1, columns=['Math', 'English', 'History'], 
              index=['Simon','Allen','Jimmy','Peter'])
# 因為之後的操作都會以這筆資料為主，我們先備份一份到df_orig裡，如果需要還原時就從df_orig還原。
# 要加copy()才會做出新的一份資料，不然兩個變數會存取同一份資料！
df_orig = df.copy()
df

       Math  English  History
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88
Peter    80       50       60

範例6

In [7]:
df.index

Index(['Simon', 'Allen', 'Jimmy', 'Peter'], dtype='object')

範例7

In [8]:
df.columns

Index(['Math', 'English', 'History'], dtype='object')

範例8

In [9]:
df.values

array([[90, 60, 33],
       [50, 70, 75],
       [70, 90, 88],
       [80, 50, 60]], dtype=int64)

範例9

In [10]:
df.shape

(4, 3)

範例10

In [11]:
df.dtypes

Math       int64
English    int64
History    int64
dtype: object

範例11

In [12]:
df.columns[0:3]

Index(['Math', 'English', 'History'], dtype='object')

範例12

In [13]:
df = df.rename({'Math':'math'}, axis=1)
df

       math  English  History
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88
Peter    80       50       60

範例13

In [14]:
df = df.rename(columns={'English':'english'})
df

       math  english  History
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88
Peter    80       50       60

範例14

In [15]:
df.columns = ['a', 'b', 'c']
df

        a   b   c
Simon  90  60  33
Allen  50  70  75
Jimmy  70  90  88
Peter  80  50  60

範例15

In [16]:
df.index = list('ABCD')
df

    a   b   c
A  90  60  33
B  50  70  75
C  70  90  88
D  80  50  60

範例16

In [17]:
df = df.reset_index()
df

  index   a   b   c
0     A  90  60  33
1     B  50  70  75
2     C  70  90  88
3     D  80  50  60

範例17

In [18]:
df = df.set_index('a') 
df

   index   b   c
a
90     A  60  33
50     B  70  75
70     C  90  88
80     D  50  60

範例18

In [19]:
df = df.set_index('index')
df

        b   c
index
A      60  33
B      70  75
C      90  88
D      50  60

範例19

In [20]:
df = df.reset_index(drop=True)
df

    b   c
0  60  33
1  70  75
2  90  88
3  50  60

範例20

In [21]:
df = df_orig.copy()
df

       Math  English  History
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88
Peter    80       50       60

範例21

In [22]:
df.set_index('Math')

      English  History
Math
90         60       33
50         70       75
70         90       88
80         50       60

範例22

In [23]:
df

       Math  English  History
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88
Peter    80       50       60

範例23

In [24]:
df.set_index('Math', inplace=True)
df

      English  History
Math
90         60       33
50         70       75
70         90       88
80         50       60

範例24

In [25]:
ch_df = pd.DataFrame({'Chinese':[55,88]},index=['Simon','Peter'])
ch_df

       Chinese
Simon       55
Peter       88

範例25

In [26]:
# 先還原df
df = df_orig.copy()
df['Chinese'] = ch_df
df

       Math  English  History  Chinese
Simon    90       60       33     55.0
Allen    50       70       75      NaN
Jimmy    70       90       88      NaN
Peter    80       50       60     88.0

範例26

In [27]:
import numpy as np
np.NaN == np.NaN

False

範例27

In [28]:
pd.isnull(np.NaN)

True

範例28

In [29]:
pd.notnull(np.NaN)

False

範例29

In [30]:
df.isnull()

        Math  English  History  Chinese
Simon  False    False    False    False
Allen  False    False    False     True
Jimmy  False    False    False     True
Peter  False    False    False    False

範例30

In [31]:
df.isnull().sum()

Math       0
English    0
History    0
Chinese    2
dtype: int64

範例31

In [32]:
df.isnull().sum().sum()

2

範例32

In [33]:
df.isnull().any(axis=1)

Simon    False
Allen     True
Jimmy     True
Peter    False
dtype: bool

範例33

In [34]:
df[df.isnull().any(axis=1)]

       Math  English  History  Chinese
Allen    50       70       75      NaN
Jimmy    70       90       88      NaN

範例34

In [35]:
df

       Math  English  History  Chinese
Simon    90       60       33     55.0
Allen    50       70       75      NaN
Jimmy    70       90       88      NaN
Peter    80       50       60     88.0

範例35

In [36]:
df.dropna()

       Math  English  History  Chinese
Simon    90       60       33     55.0
Peter    80       50       60     88.0

範例36

In [37]:
df.fillna(method='ffill')

       Math  English  History  Chinese
Simon    90       60       33     55.0
Allen    50       70       75     55.0
Jimmy    70       90       88     55.0
Peter    80       50       60     88.0

範例37

In [38]:
df.fillna(method='bfill')

       Math  English  History  Chinese
Simon    90       60       33     55.0
Allen    50       70       75     88.0
Jimmy    70       90       88     88.0
Peter    80       50       60     88.0

範例38

In [39]:
avg = df['Chinese'].mean()
df.fillna(avg)

       Math  English  History  Chinese
Simon    90       60       33     55.0
Allen    50       70       75     71.5
Jimmy    70       90       88     71.5
Peter    80       50       60     88.0

範例39

In [40]:
df.fillna(df['Chinese'].mean())

       Math  English  History  Chinese
Simon    90       60       33     55.0
Allen    50       70       75     71.5
Jimmy    70       90       88     71.5
Peter    80       50       60     88.0

In [41]:
df

       Math  English  History  Chinese
Simon    90       60       33     55.0
Allen    50       70       75      NaN
Jimmy    70       90       88      NaN
Peter    80       50       60     88.0

範例40

In [42]:
df['English']

Simon    60
Allen    70
Jimmy    90
Peter    50
Name: English, dtype: int64

範例41

In [43]:
type(df['English'])

pandas.core.series.Series

範例42

In [44]:
df.English

Simon    60
Allen    70
Jimmy    90
Peter    50
Name: English, dtype: int64

範例43

In [45]:
df[['English','Math']]

       English  Math
Simon       60    90
Allen       70    50
Jimmy       90    70
Peter       50    80

範例44

In [46]:
df[['Math','English']]

       Math  English
Simon    90       60
Allen    50       70
Jimmy    70       90
Peter    80       50

範例45

In [47]:
df[['English']]

       English
Simon       60
Allen       70
Jimmy       90
Peter       50

範例46

In [48]:
df.loc['Simon']

Math       90.0
English    60.0
History    33.0
Chinese    55.0
Name: Simon, dtype: float64

範例47

In [49]:
df.loc[['Jimmy','Simon']]

       Math  English  History  Chinese
Jimmy    70       90       88      NaN
Simon    90       60       33     55.0

範例48

In [50]:
df.iloc[[2,0]]

       Math  English  History  Chinese
Jimmy    70       90       88      NaN
Simon    90       60       33     55.0

範例49

In [51]:
df.iloc[-2:]

       Math  English  History  Chinese
Jimmy    70       90       88      NaN
Peter    80       50       60     88.0

範例50

In [52]:
df.loc[['Jimmy','Simon']][['English','History']]

       English  History
Jimmy       90       88
Simon       60       33

範例51

In [53]:
df.loc[['Jimmy','Simon'],['English','History']]

       English  History
Jimmy       90       88
Simon       60       33

範例52

In [54]:
df.loc[['Jimmy','Simon']][['English','History']] = 90
df

       Math  English  History  Chinese
Simon    90       60       33     55.0
Allen    50       70       75      NaN
Jimmy    70       90       88      NaN
Peter    80       50       60     88.0

範例53

In [55]:
df.loc[['Jimmy','Simon'],['English','History']] = 90
df

       Math  English  History  Chinese
Simon    90       90       90     55.0
Allen    50       70       75      NaN
Jimmy    70       90       90      NaN
Peter    80       50       60     88.0

範例54

In [56]:
df.loc['Simon':'Jimmy']

       Math  English  History  Chinese
Simon    90       90       90     55.0
Allen    50       70       75      NaN
Jimmy    70       90       90      NaN

範例55

In [57]:
df['Simon':'Jimmy']

       Math  English  History  Chinese
Simon    90       90       90     55.0
Allen    50       70       75      NaN
Jimmy    70       90       90      NaN

範例56

In [58]:
df.loc[:,'English':'Chinese']

       English  History  Chinese
Simon       90       90     55.0
Allen       70       75      NaN
Jimmy       90       90      NaN
Peter       50       60     88.0

範例57

In [59]:
df.loc['Simon':'Jimmy','English':'Chinese']

       English  History  Chinese
Simon       90       90     55.0
Allen       70       75      NaN
Jimmy       90       90      NaN

In [60]:
df

       Math  English  History  Chinese
Simon    90       90       90     55.0
Allen    50       70       75      NaN
Jimmy    70       90       90      NaN
Peter    80       50       60     88.0

範例58

In [61]:
df['Test'] = 30
df

       Math  English  History  Chinese  Test
Simon    90       90       90     55.0    30
Allen    50       70       75      NaN    30
Jimmy    70       90       90      NaN    30
Peter    80       50       60     88.0    30

範例59

In [62]:
df.loc['Alisa'] = [73,88,65,28,50]
df

       Math  English  History  Chinese  Test
Simon    90       90       90     55.0    30
Allen    50       70       75      NaN    30
Jimmy    70       90       90      NaN    30
Peter    80       50       60     88.0    30
Alisa    73       88       65     28.0    50

In [63]:
df = df_orig.copy()
df

       Math  English  History
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88
Peter    80       50       60

範例60

In [64]:
df['個人平均'] = df.mean(axis=1)
df

       Math  English  History       個人平均
Simon    90       60       33  61.000000
Allen    50       70       75  65.000000
Jimmy    70       90       88  82.666667
Peter    80       50       60  63.333333

範例61

In [65]:
df.loc['各科平均'] = df.mean(axis=0)
df

       Math  English  History       個人平均
Simon  90.0     60.0     33.0  61.000000
Allen  50.0     70.0     75.0  65.000000
Jimmy  70.0     90.0     88.0  82.666667
Peter  80.0     50.0     60.0  63.333333
各科平均   72.5     67.5     64.0  68.000000

In [66]:
df = df_orig.copy()
df

       Math  English  History
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88
Peter    80       50       60

範例62

In [67]:
bool_v = [True,True,False,False] 
df[bool_v]

       Math  English  History
Simon    90       60       33
Allen    50       70       75

範例63

In [68]:
bool_v = [False,True,False,True] 
df[bool_v]

       Math  English  History
Allen    50       70       75
Peter    80       50       60

範例64

In [69]:
bool_v = df['Math'] >= 60
bool_v

Simon     True
Allen    False
Jimmy     True
Peter     True
Name: Math, dtype: bool

範例65

In [70]:
df[bool_v]

       Math  English  History
Simon    90       60       33
Jimmy    70       90       88
Peter    80       50       60

範例66

In [71]:
df[df['Math'] >= 60]

       Math  English  History
Simon    90       60       33
Jimmy    70       90       88
Peter    80       50       60

範例67

In [72]:
df[df['Math'] < 60]

       Math  English  History
Allen    50       70       75

範例68

In [73]:
df[(df['Math']>=60) & (df['English']>85)]

       Math  English  History
Jimmy    70       90       88

範例69

In [74]:
df.query('Math>=60 & English>85')

       Math  English  History
Jimmy    70       90       88

範例70

In [75]:
df[(df['Math']<60) | (df['English']>85)]

       Math  English  History
Allen    50       70       75
Jimmy    70       90       88

範例71

In [76]:
df.query('Math < 60 | English > 85')

       Math  English  History
Allen    50       70       75
Jimmy    70       90       88

In [77]:
df = df_orig.copy()
df

       Math  English  History
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88
Peter    80       50       60

資料橫向合併。先檢視df2

In [78]:
scores2 = {'Art':[100,90,70,80],
       'Music':[60,70,70,50]}
df2 = pd.DataFrame(scores2, index=['Allen','Simon', 'Jimmy', 'Peter'])
df2

       Art  Music
Allen  100     60
Simon   90     70
Jimmy   70     70
Peter   80     50

範例72

In [79]:
pd.concat([df,df2], axis=1)

       Math  English  History  Art  Music
Simon    90       60       33   90     70
Allen    50       70       75  100     60
Jimmy    70       90       88   70     70
Peter    80       50       60   80     50

範例73

In [80]:
n_df = pd.DataFrame([[77,22,88],[63,22,22]], 
            columns = df.columns, index = ['JJ','Alin'])
n_df

      Math  English  History
JJ      77       22       88
Alin    63       22       22

範例74

In [81]:
pd.concat([df,n_df], axis=0)

       Math  English  History
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88
Peter    80       50       60
JJ       77       22       88
Alin     63       22       22

範例75

In [82]:
df.append(n_df)

C:\Users\User\AppData\Local\Temp\ipykernel_22348\2236117000.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(n_df)

       Math  English  History
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88
Peter    80       50       60
JJ       77       22       88
Alin     63       22       22

範例76

In [83]:
df['性別'] = ['男','女','男','男']
df

       Math  English  History 性別
Simon    90       60       33  男
Allen    50       70       75  女
Jimmy    70       90       88  男
Peter    80       50       60  男

範例77

In [84]:
n_df = pd.DataFrame([['男',100],['女',200]], columns=['性別','時薪'])
n_df

  性別   時薪
0  男  100
1  女  200

範例78

In [85]:
df.merge(n_df,on='性別')

   Math  English  History 性別   時薪
0    90       60       33  男  100
1    70       90       88  男  100
2    80       50       60  男  100
3    50       70       75  女  200

範例79

In [86]:
df = df_orig.copy()
df.head()

       Math  English  History
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88
Peter    80       50       60

範例80

In [87]:
df.head(3)

       Math  English  History
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88

範例81

In [88]:
df.iloc[0:3]

       Math  English  History
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88

範例82

In [89]:
df.tail(3)

       Math  English  History
Allen    50       70       75
Jimmy    70       90       88
Peter    80       50       60

範例83

In [90]:
df.iloc[-3:]

       Math  English  History
Allen    50       70       75
Jimmy    70       90       88
Peter    80       50       60

範例84

In [91]:
df.sample(2)

       Math  English  History
Simon    90       60       33
Allen    50       70       75

範例85

In [92]:
df.describe()

            Math    English    History
count   4.000000   4.000000   4.000000
mean   72.500000  67.500000  64.000000
std    17.078251  17.078251  23.622024
min    50.000000  50.000000  33.000000
25%    65.000000  57.500000  53.250000
50%    75.000000  65.000000  67.500000
75%    82.500000  75.000000  78.250000
max    90.000000  90.000000  88.000000

範例86

In [93]:
df.mean()

Math       72.5
English    67.5
History    64.0
dtype: float64

範例87

In [94]:
df.sum()

Math       290
English    270
History    256
dtype: int64

範例88

In [95]:
df.max()

Math       90
English    90
History    88
dtype: int64

範例89

In [96]:
df.min()

Math       50
English    50
History    33
dtype: int64

範例90

In [97]:
df.nlargest(1,'Math')

       Math  English  History
Simon    90       60       33

範例91

In [98]:
df.nlargest(2,'Math')

       Math  English  History
Simon    90       60       33
Peter    80       50       60

範例92

In [99]:
df.sort_values('Math', ascending=False)

       Math  English  History
Simon    90       60       33
Peter    80       50       60
Jimmy    70       90       88
Allen    50       70       75

範例93

In [100]:
df.sort_values('Math', ascending=False).head(2)

       Math  English  History
Simon    90       60       33
Peter    80       50       60

範例94

In [101]:
df.nsmallest(2,'Math')

       Math  English  History
Allen    50       70       75
Jimmy    70       90       88

範例95

In [102]:
df.rank(ascending=False)

       Math  English  History
Simon   1.0      3.0      4.0
Allen   4.0      2.0      2.0
Jimmy   3.0      1.0      1.0
Peter   2.0      4.0      3.0

範例96

In [103]:
df['平均'] = df.mean(axis=1).round(2) # 小數點2位
df['名次'] = df['平均'].rank(ascending=False)
df

       Math  English  History     平均   名次
Simon    90       60       33  61.00  4.0
Allen    50       70       75  65.00  2.0
Jimmy    70       90       88  82.67  1.0
Peter    80       50       60  63.33  3.0

範例97

In [104]:
df['性別'] = ['男','女','男','男']
df

       Math  English  History     平均   名次 性別
Simon    90       60       33  61.00  4.0  男
Allen    50       70       75  65.00  2.0  女
Jimmy    70       90       88  82.67  1.0  男
Peter    80       50       60  63.33  3.0  男

範例98

In [105]:
df['性別'].nunique()

2

範例99

In [106]:
df['性別'].unique()

array(['男', '女'], dtype=object)

範例100

In [107]:
df['性別'].value_counts()

男    3
女    1
Name: 性別, dtype: int64

先復原df

In [108]:
df = df_orig.copy()
df

       Math  English  History
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88
Peter    80       50       60

範例101

In [109]:
df['日期'] = pd.to_datetime(['2016-01-01','2017-05-03','2017-05-13','2018-01-05'])
df

       Math  English  History         日期
Simon    90       60       33 2016-01-01
Allen    50       70       75 2017-05-03
Jimmy    70       90       88 2017-05-13
Peter    80       50       60 2018-01-05

範例102

In [110]:
df['日期'] + pd.Timedelta(2,'D')

Simon   2016-01-03
Allen   2017-05-05
Jimmy   2017-05-15
Peter   2018-01-07
Name: 日期, dtype: datetime64[ns]

範例103

In [111]:
df['日期'].dt.year

Simon    2016
Allen    2017
Jimmy    2017
Peter    2018
Name: 日期, dtype: int64

範例104

In [112]:
df['日期'].dt.month

Simon    1
Allen    5
Jimmy    5
Peter    1
Name: 日期, dtype: int64

範例105

In [113]:
df['日期'].dt.day

Simon     1
Allen     3
Jimmy    13
Peter     5
Name: 日期, dtype: int64

範例106

In [114]:
df['日期'].dt.day_name()

Simon       Friday
Allen    Wednesday
Jimmy     Saturday
Peter       Friday
Name: 日期, dtype: object

範例107

In [115]:
df['日期'].dt.quarter

Simon    1
Allen    2
Jimmy    2
Peter    1
Name: 日期, dtype: int64

範例108

In [116]:
df[df['日期'].dt.year==2017]

       Math  English  History         日期
Allen    50       70       75 2017-05-03
Jimmy    70       90       88 2017-05-13

範例109

In [117]:
df[df['日期'].dt.month==5]

       Math  English  History         日期
Allen    50       70       75 2017-05-03
Jimmy    70       90       88 2017-05-13

範例110

In [118]:
df.set_index('日期', inplace=True)
df

            Math  English  History
日期
2016-01-01    90       60       33
2017-05-03    50       70       75
2017-05-13    70       90       88
2018-01-05    80       50       60

範例111

In [119]:
df.loc['2017']

            Math  English  History
日期
2017-05-03    50       70       75
2017-05-13    70       90       88

範例112

In [120]:
df.loc['2017-05']

            Math  English  History
日期
2017-05-03    50       70       75
2017-05-13    70       90       88

範例113

In [121]:
df.index.month

Int64Index([1, 5, 5, 1], dtype='int64', name='日期')

範例114

In [122]:
df[df.index.month == 1]

            Math  English  History
日期
2016-01-01    90       60       33
2018-01-05    80       50       60

範例115

In [123]:
s = pd.Series([1,2,3,4,5])
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

範例116

In [124]:
s+2

0    3
1    4
2    5
3    6
4    7
dtype: int64

範例117

In [125]:
s.apply(lambda x: x+1 if (x%2)==1 else x-1)

0    2
1    1
2    4
3    3
4    6
dtype: int64

範例118

In [126]:
def data_process(x):
  if (x%2) == 1:
    return x+1
  else:
    return x-1
s.apply(data_process)

0    2
1    1
2    4
3    3
4    6
dtype: int64

範例119

In [127]:
s.apply(lambda x: True if (x%2)==1 else False)

0     True
1    False
2     True
3    False
4     True
dtype: bool

範例120

In [128]:
s[s.apply(lambda x: True if (x%2)==1 else False)]

0    1
2    3
4    5
dtype: int64

範例121

In [129]:
s[(s % 2) == 1]

0    1
2    3
4    5
dtype: int64

假設df

In [130]:
scores = {'Math':[900,50,730,80],
          'History':[33,75,np.NaN,np.NaN]}
df = pd.DataFrame(scores, index = ['Simon','Allen','Jimmy','Peter'])
df

       Math  History
Simon   900     33.0
Allen    50     75.0
Jimmy   730      NaN
Peter    80      NaN

範例122

In [131]:
df.apply(max)
# 當然df.max()較簡單

Math       900.0
History     75.0
dtype: float64

範例123

In [132]:
df.apply(max, axis=1)
# 當然df.max(axis=1)較簡單

Simon    900.0
Allen     75.0
Jimmy    730.0
Peter     80.0
dtype: float64

載入 df

In [133]:
scores = {'Math':[900,'50',730,80],
          'History':[33,75,77,880]}
df = pd.DataFrame(scores, index = ['Simon','Allen','Jimmy','Peter'])
df

      Math  History
Simon  900       33
Allen   50       75
Jimmy  730       77
Peter   80      880

範例124

In [134]:
df.applymap(lambda x: type(x) == str)

        Math  History
Simon  False    False
Allen   True    False
Jimmy  False    False
Peter  False    False

範例125

In [135]:
df[df.applymap(lambda x: type(x) == str)]

      Math  History
Simon  NaN      NaN
Allen   50      NaN
Jimmy  NaN      NaN
Peter  NaN      NaN

範例126

In [136]:
df = df.applymap(int)
df

       Math  History
Simon   900       33
Allen    50       75
Jimmy   730       77
Peter    80      880

範例127

In [137]:
df.applymap(lambda x: type(x)==int)

       Math  History
Simon  True     True
Allen  True     True
Jimmy  True     True
Peter  True     True

範例128

In [138]:
df.dtypes

Math       int64
History    int64
dtype: object

範例129

In [139]:
df[df>100]

        Math  History
Simon  900.0      NaN
Allen    NaN      NaN
Jimmy  730.0      NaN
Peter    NaN    880.0

範例130

In [140]:
df[df>100] = df/10
df

       Math  History
Simon    90       33
Allen    50       75
Jimmy    73       77
Peter    80       88